package initializer

//----------------------------------------------------------------------------------------------------------------------------//

type (
	// Инициализатор модуля
	ModuleInitializer func(cfg any, h any) error
)

var (
	// Инициализаторы модулей
	initializers = []ModuleInitializer{}
)

//----------------------------------------------------------------------------------------------------------------------------//

// Добавить инициализатор модуля
func RegisterModuleInitializer(f ModuleInitializer) {
	initializers = append(initializers, f)
}

//----------------------------------------------------------------------------------------------------------------------------//

// Инициализируем модули
func Do(cfg any, h any) (err error) {
	for _, f := range initializers {
		err = f(cfg, h)
		if err != nil {
			return
		}
	}

	return
}

//----------------------------------------------------------------------------------------------------------------------------//
